{
    "reviews": [
        {
            "review_id": "60ab83b14177a567e8bb7dab",
            "brand_id": "45275",
            "title": "Beware ",
            "content": "3 months ago I applied for a PPP loan through this company this company claimed that the SBA denied my loan due to my criminal history which in the passed 5yrs the only criminal history that I have is tickets but anyway the company sends me an email after 50 emails and phone calls telling me to fill something out to Appeal the SBA decision I did as asked and 1 month and 150 emails later and phone calls I haven't heard anything back from anyone since. This is tragic and the sad thing is I have a real life legit business and the fraudsters have gotten money but I can't get nothing this is BS at its fullest. ",
            "author": "Phillip",
            "user_location": "Lehigh Acres, FL",
            "star_rating": 1,
            "date": "2021-05-24",
            "recommended": false
        },
        {
            "review_id": "60a2a3c61f17c6576d8e9d01",
            "brand_id": "45275",
            "title": "Misleading Loan process leads to personal credit damage",
            "content": "We initiated the loan process with Dream Spring to receive an SBA backed loan. After providing years of financial records for our business, personal financial statements, and multiple other qualifying documents we were told the SBA loan was not an option, but other business loans were available. The end story is that the \"business loan\" we were given was a \"personal\" loan, they pulled credit scores from all 3 agencies which significantly negatively impacted personal credit. Now, instead of having a business loan I have a personal loan for $23,000 on my credit report. I could have walked into my bank and received a personal loan for twice as much without the credit pulls and knocks on my personal credit file. There was NO communication that this would happen, nor was it disclosed in loan documents. In fact, throughout the email process it was stated multiple times it was a business loan, it wasn't, that the credit pull would only happen with one reporting agency, it didn't. Transparency and proper expectations are critical to small business decisions, Dream Spring failed on both accounts in this manner. ",
            "author": "Peter",
            "user_location": "Zephyr Cove, NV",
            "star_rating": 1,
            "date": "2021-05-17",
            "recommended": false
        },
        {
            "review_id": "6080af2764407e6f0a1f1965",
            "brand_id": "45275",
            "title": "Worst experience ever",
            "content": "I applied through third party and had to sign several documents over and over again. They claim they sent ach but my bank say there never received anything from them. I called and left several messages and  thet returned call but weeks later sent a message  blaming the third party. I check caweb and it’s states lender cancelled. No explanation why?",
            "author": "Keona",
            "user_location": "Mooresville, NC",
            "star_rating": 1,
            "date": "2021-04-21",
            "recommended": false
        },
        {
            "review_id": "6075bb47377e9f5f09a16f42",
            "brand_id": "45275",
            "title": "Use ANY other company. Absolute trash",
            "content": "I have been trying to get in contact with their company for MONTHS. I have left a total of 12 messages without any call back, email response or any type of attempt to communicate with me. This is hands down the worst company to ever conduct business with. They approved then reversed my loan amount without any explanation. Please do yourself a favor and use ANY other company ",
            "author": "Michael",
            "user_location": "Tucson, AZ",
            "star_rating": 1,
            "date": "2021-04-13",
            "recommended": false
        },
        {
            "review_id": "60651bdb377e9f5f09a1686d",
            "brand_id": "45275",
            "title": "They won’t tell you how long till you’re getting your funds!! PPP",
            "content": "I applied for my PPP Loan via Womply this lender says they were wet Womply But they want you to contact them instead of tell you when you’re going to get your money well if they work with them why do I have to call them and ask them? Because Womply  doesn’t answer the phone either. But they did say that most lenders after the promissory note is fine 2 to 3 business days to get your money I don’t believe that’s the case with this bank",
            "author": "Susan",
            "user_location": "Fort Myers, FL",
            "star_rating": 1,
            "date": "2021-03-31",
            "recommended": false
        },
        {
            "review_id": "5e9650acf2d6c900012ad540",
            "brand_id": "45275",
            "title": "Worthless",
            "content": "This is the most worthless lending company (other than the one you can eat only spelled differently ) that I've dealt with!! DO NOT let these sorry people fund your \"business loan\".  It will go against your personal credit.  When it does that it will jack up your personal credit DTI.  In my case, it cost me 40 points on my personal FICO score.  Such a load of...  A BUSINESS loan should report to my D\u0026B, Experian Business, and/or Equifax Small Business like any other business loan/financing.  But not with these useless hacks.  They don't even bother to tell you upfront that it will report to your personal credit report.  Had I know, I NEVER would have signed the loan paperwork.  Bait and switch nonsense from a bunch of sorry hacks!!  And, when I called them out on it, they were like, \"Oh well\"!!!!!  Don't waste  your efforts.",
            "author": "Scott",
            "user_location": "Atlanta, GA",
            "star_rating": 1,
            "date": "2020-04-14",
            "recommended": false
        },
        {
            "review_id": "5e686ee0ff5eaf0001eff92d",
            "brand_id": "45275",
            "title": "It has been a great experience",
            "content": "The DreamSpring agent Kevin made securing this loan almost easy especially with me not sure I would be approved for use of funds for our Non Profit Military and Veterans Support Company. ",
            "author": "Robert",
            "user_location": "COLORADO SPRINGS, CO",
            "star_rating": 5,
            "date": "2020-03-11",
            "recommended": true
        },
        {
            "review_id": "5e5747fdad1817000167f977",
            "brand_id": "45275",
            "title": "Very good experience",
            "content": "I'm happy with the overall exp*******.They were very friendly and informative .Felt very comfortable",
            "author": "Laverne",
            "user_location": "ROSWELL, NM",
            "star_rating": 5,
            "date": "2020-02-26",
            "recommended": true
        },
        {
            "review_id": "5e39f02aa2f1e80001ab5ab9",
            "brand_id": "45275",
            "title": "It was good experience",
            "content": "The entire process was easy, employee help me get through the whole process. Very understandable. Thanks",
            "author": "Lou",
            "user_location": "CUBA, NM",
            "star_rating": 5,
            "date": "2020-02-04",
            "recommended": true
        },
        {
            "review_id": "5d1b731cafb8510001ae7569",
            "brand_id": "45275",
            "title": "Accion has been wonderful to us",
            "content": "Accion has been wonderful to us as we build our business in New Mexico.\u003cbr /\u003eWe relocated to Arizona and are on loan 2, as we expand our services. \u003cbr /\u003eBoth loans have been easy and very fair.\u003cbr /\u003eWe appreciate the help and encouragement services as well as the financing.",
            "author": "Ellery",
            "user_location": "Tucson, AZ",
            "star_rating": 5,
            "date": "2018-10-01",
            "recommended": true
        },
        {
            "review_id": "5d1b731cafb8510001ae756a",
            "brand_id": "45275",
            "title": "Great business partner for me and my business!",
            "content": "Great business partner for me and my business! Highly recommend them!!",
            "author": "Kendra",
            "user_location": "Albuquerque, NM",
            "star_rating": 5,
            "date": "2018-05-14",
            "recommended": true
        },
        {
            "review_id": "5d1b731dafb8510001ae756c",
            "brand_id": "45275",
            "title": "I would not be able to launch our business without the help Accion has provided",
            "content": "I would not be able to launch our business, Chez D's Food Truck with out the help Accion has provided. Their staff is very helpful, knowledgeable, and prompt. This is our second loan and we managed the entire process on-line and on the phone.\u003cbr /\u003eThanks Martin Montes de Oca for helping me through our last loan. You rock!",
            "author": "Ed",
            "user_location": "Mesa, AZ",
            "star_rating": 5,
            "date": "2018-02-14",
            "recommended": true
        },
        {
            "review_id": "5d1b731cafb8510001ae756b",
            "brand_id": "45275",
            "title": "This company provided a loan with a minimum of fuss and requirements.",
            "content": "This company provided a loan with a minimum of fuss and requirements. Believe me, that is a relief and a delight in this day of increased caution and fewer resources for start up small businesses.",
            "author": "Elisabeth",
            "user_location": "Tucson, AZ",
            "star_rating": 5,
            "date": "2018-02-14",
            "recommended": true
        },
        {
            "review_id": "5d1b731dafb8510001ae756e",
            "brand_id": "45275",
            "title": "Thanks to someone like Accion",
            "content": "Thanks to someone like Accion small business owners can rely on someone that they trust to take care of their small business loan needs",
            "author": "Fabian",
            "user_location": "Beaumont, TX",
            "star_rating": 5,
            "date": "2018-02-13",
            "recommended": true
        },
        {
            "review_id": "5d1b731dafb8510001ae756d",
            "brand_id": "45275",
            "title": "For small business lending a great place to start.",
            "content": "For small business lending a great place to start. Some of their resources are helpful. Time frames are better than most banks. Give them a shot to get you going. They were able to also help one of our other divisions get started in another state.",
            "author": "David",
            "user_location": "Rio Rancho, NM",
            "star_rating": 5,
            "date": "2018-02-13",
            "recommended": true
        }
    ]
}